package lesson3;

public class Hw {

  //Задание 2
  //В переменной n хранится натуральное (целое) трехзнач-
  //ное число. Создайте программу, вычисляющую и выводя-
  //щую на экран сумму цифр числа n.
  public static void main(String[] args) {

    int num = 753;

    int num1 = num / 100;
    //int num2 =
    //int num3 =
    System.out.println(num1);


    //Задание 3
    //В переменной n хранится вещественное число, с ненуле-
    //вой дробной частью. Создайте программу, округляющую
    //число n до ближайшего целого и выводящую результат
    //округления на экран.
    Math.round(10.5);


    final int num3 = 12;
    //num3 = 10;

  }
}
